Autodesk.Revit.UI.UIFabricationUtils.ResetChangeServiceMappings(Autodesk.Revit.DB.Document,System.Int32)
Resets the mappings associated to the passed in service identifier.
document:
The document.
serviceId:
The fabrication service identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetChangeServiceDeleteFailuresState(Autodesk.Revit.DB.Document,System.Boolean)
Sets the state for change service to either keep or delete parts that encounter errors.
document:
The document.
state:
The state is either true to delete or false keep parts that encounter errors.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetChangeServiceMappingState(Autodesk.Revit.DB.Document,System.Boolean)
Sets the state for change service mappings to either use or ignore the mappings.
document:
The document.
state:
The state is either true to ignore or false to use the mappings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetCanFinishChangeService(Autodesk.Revit.DB.Document)
Checks if Change Service can finish or not.
doc:
The document.
Returns:
Gets whether Change Service can finish or not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetCanFinishChangeService(Autodesk.Revit.DB.Document,System.Boolean)
Sets if finishing Change Service is allowed or not.
doc:
The document.
canFinish:
Sets whether we can finish Change Service or not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.CancelSwapOutMode
Cancels the service and size swap out modes.
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.FinishSwapOutMode
Finishes the service and size swap out modes.
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutShapeForMouseOver(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.ConnectorProfileType)
Sets the shape information to select the elements in the model from moused-over shapes.
document:
The document.
serviceId:
The fabrication service identifier.
shape:
The shape of the parts to be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.ServiceSwapOutPartTypeMouseOver(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Sets the required information to select the part types in the model from the moused-over fittings.
document:
The document.
partTypeId:
The part type Id. Pass InvalidElementId to select none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutServiceIdForMouseOver(Autodesk.Revit.DB.Document,System.Int32)
Sets the service id to select the elements in the model from the moused-over service.
document:
The document.
serviceId:
The service id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutSizesForMouseOver(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.ConnectorProfileType,System.Double,System.Double)
Sets the required information to select the elements in the model from the moused-over sizes.
document:
The document.
serviceId:
The fabrication service identifier.
profileType:
The shape of the parts to be selected.
widthOrDiameter:
The width or diameter of the parts to be selected.
depth:
The depth of the parts to be selected. Pass 0 if the profile type is Round.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutSizeMappings(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap})
Sets the service swap out size mappings
document:
The document.
mappings:
The service swap out size mappings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutPartTypeMappings(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId})
Sets the service swap out part type mappings
document:
The document.
mappings:
The service swap out part type mappings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.UI.UIFabricationUtils.SetRestrictServicePaletteForSwapOut(Autodesk.Revit.DB.Document,System.Boolean)
Sets the restrict service palette state for service swap out.
document:
The document.
restrictPalette:
The restrict service palette state, when enabled the service swap out will only use the assigned palette index.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServicePaletteForSwapOut(Autodesk.Revit.DB.Document,System.Int32)
Sets the service palette for service swap out.
document:
The document.
paletteIndex:
The service palette index.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceForSwapOut(Autodesk.Revit.DB.Document,System.Int32)
Sets the service for service swap out.
document:
The document.
serviceId:
The service id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetConditionSizeDescription(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.FormatOptions)
Gets the condition description for a service button's sizing condition.
document:
The document used to extract unit information from.
button:
The fabrication service button to query.
conditionIndex:
The condition index of the fabrication service button to query.
formatOptions:
The formatting options to use to format size text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.RouteAndFillPartBrowserOnMouseLeave(Autodesk.Revit.DB.Document)
The mouse leaves the fabrication route and fill part browser.
document:
The document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RouteAndFillPartBrowserOnPartTypeChanged(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
The fabrication route and fill part types are changed from the fabrication part browser, so the available solutions are needed to updated.
doc:
The document.
requiredTypeId:
The fabrication part type id that must be included in the route and fill solutions.If the id is invalid, it will be ignored.
optionalTypeId:
The fabrication part type id that may or mat not be included from the route and fill solutions. If the id is invalid, will be ignored.
selectedTypeId:
The fabrication part type id that is currently selected in the Fabrication Part Browser.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetupFabricationPrinters(Autodesk.Revit.DB.Document,System.Int32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetFabricationPrinterToDefault(Autodesk.Revit.DB.Document,System.Int32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetFabricationPrinterFile(Autodesk.Revit.DB.Document,System.Int32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.ExportFabricationData(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationExportType,System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
file:
full path, as returned by getFabricationExports
partIds:
the parts that will be exported.
Returns:
whether the export was successful
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetupFabricationExports(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationExportType,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
shows modal UI to setup all fabrication exports of the specified type.
partIds:
used if user clicks 'export now'
Returns:
returns whether the user completed the UI successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetFabricationExports(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationExportType)
Returns:
dictionary of path / description pairs, where path is the unique key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetupFabricationReports(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationReportType,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.PrintFabricationReports(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Returns:
returns if any reports were printed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetReportBinaryPath(Autodesk.Revit.DB.Document,System.String)
set path where qrcode and barcode Dlls can be found
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.EditConfiguration(Autodesk.Revit.DB.Document,System.String,System.String)
Returns:
returns if the configuration was changed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RebuildLoadedDatabase(Autodesk.Revit.DB.Document)
we need the for fabrication setting form when user clicked sync with source and cancel the form. when the internal rebuildLoadedDatabase is not called
because transaction was rolled back, but we need the reload the workspace
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.IsFabConfigConnectedToSource(Autodesk.Revit.DB.Document)
checks if the fabrication is connected to source
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.IsAllowedToPlacePart(Autodesk.Revit.DB.Document)
Checks if placing part is allowed or not.
For example, placing part is not allowed if the document is not allowed to change.
doc:
The document.
Returns:
True if placing part is allowed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetIsLT
Checks if the current product discipline is LT.
Returns:
returns whether LT is the current product discipline.
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetIsMPR(Autodesk.Revit.DB.Document)
Checks if starting MPR is currently active
doc:
The document.
Returns:
returns whether MPR is currently active
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetIsMPR(Autodesk.Revit.DB.Document,System.Boolean)
Sets if MPR is currently active or not.
doc:
The document.
isMPR:
sets whether MPR is valid for the current service palette.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetCanMPR(Autodesk.Revit.DB.Document)
Checks if starting MPR is allowed or not.
doc:
The document.
Returns:
gets whether MPR is valid for the current service palette.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetCanMPR(Autodesk.Revit.DB.Document,System.Boolean)
Sets if starting MPR is allowed or not.
doc:
The document.
canMPR:
sets whether MPR is valid for the current service palette.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.IsJournalReplaying
Indicates whether it is in journal replaying mode.
Returns:
True if it is in journal replaying mode, false otherwise.
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RestartMPR(Autodesk.Revit.DB.Document)
Call to restart multi point routing service.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RouteFabricationService(Autodesk.Revit.DB.Document,System.Int32,System.Int32)
Call to start routing fabrication service.
serviceId:
The Fabrication service.
paletteIndex:
The Fabrication service palette index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
checks the service palette is valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.PlaceFabricationPart(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.FabricationItemFile)
Call to place a fabrication part from an item file.
doc:
The document.
serviceId:
The service Id to associate with the item file.
itemFile:
The item file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.PlaceFabricationPart(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton)
Call to place a fabrication part.
serviceButton:
The Fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentException:
checks the service id, tab index and button index and makes sure they are valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetCurrentServiceInfo(Autodesk.Revit.DB.Document,System.Int32,System.Int32)
call to initialise what service / palette will be used if MPR command is initiated from outside the part browser.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetOpenConnectorIndicatorAwayColor
Gets the color of the open connector indicator in away direction.
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorAwayColor(Autodesk.Revit.DB.Color)
Sets the color of the open connector indicator in away direction
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.GetOpenConnectorIndicatorTowardsColor
Gets the color of the open connector indicator in towards direction.
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorTowardsColor(Autodesk.Revit.DB.Color)
Sets the color of the open connector indicator in towards direction
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.GetOpenConnectorIndicatorPlanColor
Gets the color of the open connector indicator in plan view.
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorPlanColor(Autodesk.Revit.DB.Color)
Sets the color of the open connector indicator in plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils
General Fabrication UI utility methods in Revit UI.
Since:
2016